{
    "version": "https://jsonfeed.org/version/1",
    "title": "100trains",
    "description": "",
    "home_page_url": "https://100trains.com",
    "feed_url": "https://100trains.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "railfan"
    },
    "items": [
        {
            "id": "https://100trains.com/qualifications-to-operate-a-train.html",
            "url": "https://100trains.com/qualifications-to-operate-a-train.html",
            "title": "Qualifications to Operate a Train",
            "summary": "Qualifications to Operate a Train Being in charge of operating a train is a huge responsibility, and one that requires plenty of training before it is possible. The specific requirements depend on the type of train that is being operated. It may be a cargo&hellip;",
            "content_html": "Qualifications to Operate a Train<br>\n<h2>Being in charge of operating a train is a huge responsibility, and one that requires plenty of training before it is possible. The specific requirements depend on the type of train that is being operated. It may be a cargo train, passenger train, or one that carries hazardous materials. There are commuter trains as well in various cities to help reduce the amount of traffic on the roads.</h2>\n<p><img class=\"post__image--center\" src=\"https://2.bp.blogspot.com/-Q57hCu49b8Q/UueUMoCH_yI/AAAAAAAABTI/au4N7q32Pbs/s1600/goldh1.png\" alt=\"train\" width=\"1020\" height=\"606\"><br>There are some specific requirements though that apply to all types of trains. To help prevent the risk of problems while navigating a train, those on board must pass written testing, continue to engage in training offered by their employer, and pass a complete health exam annually. Those in charge of operating a train must have very good eyesight and hearing in order to fill the requirements of the job. <br><br>It is now required for all personnel operating a train to pass a background check and to show that they are a citizen of the United States in an effort to reduce the chances of terrorism involving trains. Many employers are also requesting a complete mental evaluation as well. <br><br>A full understanding of English both in the written and verbal forms are required. There are many different types of crew members on a train with the engineer being the one in charge. It takes more training, education, and credentials to hold such a position.<br><br>Various tests many be given to determine if someone is a good fit for a job operating a train. These tests are designed to evaluate their ability to make quick decisions, their navigational skills, their ability to follow instructions, leadership, and communication skills. All of these are very important for being successful at operating a train properly.<br><br>Any individual that wants to become an engineer has to be at least 21 years of age. There are plenty of areas of the job that need to be taken seriously when operating a train as a crew member or as an engineer. The train needs to be carefully inspected prior to taking a trip. The crew has to know how to manipulate the train in response to the load and weather conditions.<br><br>A great deal of the training for operating a train has to do with technology. Most of the controls are in place with the best possible technology behind them. Having a solid understanding of how a train operates and how to use computers is very helpful for anyone wishing to pursue such a career choice.<br><br>You will find excellent programs and most colleges to build a solid foundation in the area of engineering. Once you have earned a degree from an accredited school, you can contact the various railroad companies to find out about the available jobs. They will likely have you take part in their own training programs to teach you the specifics of how they operate their equipment. They will also want to ensure you know proper safety procedures to follow.<br><br>The average annual earnings for a train engineer is $61,850. This is very good pay for a job that requires plenty of attention to details. The forecast for jobs in the area of operating trains is one that is going to be lower in ten years than the demand for it now. While there will likely be more trains in use, it is believed technology will allow them to operate faster and more efficient so fewer humans will be needed in order to operate them.</p>\n<p><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">script</span> <span class=\"hljs-attr\">type</span>=<span class=\"hljs-string\">\"application/ld+json\"</span>&gt;</span><span class=\"javascript\"> { <span class=\"hljs-string\">\"@context\"</span>: <span class=\"hljs-string\">\"http://schema.org/\"</span>, <span class=\"hljs-string\">\"@type\"</span>: <span class=\"hljs-string\">\"Review\"</span>, <span class=\"hljs-string\">\"itemReviewed\"</span>: { <span class=\"hljs-string\">\"@type\"</span>: <span class=\"hljs-string\">\"Thing\"</span>, <span class=\"hljs-string\">\"name\"</span>: <span class=\"hljs-string\">\"Qualifications to Operate a Train\"</span> }, <span class=\"hljs-string\">\"author\"</span>: { <span class=\"hljs-string\">\"@type\"</span>: <span class=\"hljs-string\">\"Person\"</span>, <span class=\"hljs-string\">\"name\"</span>: <span class=\"hljs-string\">\"Railfan\"</span> }, <span class=\"hljs-string\">\"reviewRating\"</span>: { <span class=\"hljs-string\">\"@type\"</span>: <span class=\"hljs-string\">\"Rating\"</span>, <span class=\"hljs-string\">\"ratingValue\"</span>: <span class=\"hljs-string\">\"4\"</span>, <span class=\"hljs-string\">\"bestRating\"</span>: <span class=\"hljs-string\">\"5\"</span> }, <span class=\"hljs-string\">\"publisher\"</span>: { <span class=\"hljs-string\">\"@type\"</span>: <span class=\"hljs-string\">\"Organization\"</span>, <span class=\"hljs-string\">\"name\"</span>: <span class=\"hljs-string\">\"100trains\"</span> } } </span><span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">script</span>&gt;</span></p>",
            "image": "https://100trains.com/media/posts/5/",
            "author": {
                "name": "railfan"
            },
            "tags": [
                   "trains",
                   "railway"
            ],
            "date_published": "2018-09-21T21:43:43+05:30",
            "date_modified": "2018-09-26T00:40:43+05:30"
        },
        {
            "id": "https://100trains.com/Grand-Central-Terminal.html",
            "url": "https://100trains.com/Grand-Central-Terminal.html",
            "title": "Grand Central Terminal",
            "summary": "Grand Central Terminal In New York City you will find Grand Central Terminal which is a famous landmark in reference to train stations. The terminal that is in place today was built in 1913 and it was built specifically for electric powered trains. Many people&hellip;",
            "content_html": "Grand Central Terminal<br>\n<h2>In New York City you will find Grand Central Terminal which is a famous landmark in reference to train stations. The terminal that is in place today was built in 1913 and it was built specifically for electric powered trains. Many people visit Grand Central Terminal today not to ride a train, but to take a look at the various architectural designs it has to offer.</h2>\n<br>The most popular features include the marble staircase that never seems to lose its beauty. There are also numerous windows in the terminal that are 75 feet tall. You may end up bumping into many people while you are at the terminal because many of them walk around with their heads facing the ceiling due to the amazing paintings on it. There are plenty of starts up there where you will quickly forget where you really are at. <br><br>One of the reasons why this is such a busy train station to day is because there are so many large corporate offices and businesses in the area. It is very easy for businessmen to take a train to the Grand Central Terminal and then walk the remaining distance so their place of employment or for a meeting taking place in one of the area business locations.<br><br>If you find yourself at the Grand Central Terminal for any length of time you can enjoy one of the coffee shops or restaurants. There are also a couple of bars where you can enjoy a drink. There is an excellent selection of casual dining as well as fine dining in the Grand Central Terminal. <br><br>Don’t forget to check out the market offered at the terminal as well. Here you will find an amazing selection of fresh fruits and vegetables for sale. There are also fresh coffee beans, baked goods, prime cuts of meat, quality cheeses, and chocolate delights that are made right in front of your eyes. This is a very colorful and fun place to explore when you visit the Grand Central Terminal. <br><br>Many people want to the terminal in order to shop as there are over 50 shops featured there. In these shops you will find clothing, shoes, electronics, toys, a small museum, luggage, books, beauty supplies, and even locations to get your hair and nails done. You can literally spend days at Grand Central Terminal doing nothing but shopping and pampering yourself. <br><br>For some fun while you are visiting the terminal, make sure you visit the Whispering Gallery. Due to the architectural design of the terminal there is a place where you can whisper and it will echo loud like you are shouting. This is due to the various dynamic acoustics in that area of the terminal. The curved layout of the ceiling offers just the right elements necessary to allow this to happen. <br><br>There are plenty of different events that take place at Grand Central Terminal throughout the year. They offer a splendid holiday décor that you will fall in love with. In addition to the many shops in the terminal, vendors are allowed to set up their booths to sell wonderful handmade crafts and Christmas ornaments. They also offer plenty of free entertainment and host art shows during the year to help support the arts. You can easily access a calendar of events for the Grand Central Terminal online. <br><br>Today Grand Central Terminal is considered to be a historical landmark. There has been plenty of money invested in it to preserve the beauty of this remarkable train station. If you haven’t seen it you need to put it on your list of places to visit while in New York City. <br><br>If you have ever heard the term Grand Central Station, this is in reference to the subway system found beneath the Grand Central Terminal. This is an icon of the hustle and bustle of New York City. Every effort has been made to preserve it and to honor the vitality of the train industry.",
            "image": "https://100trains.com/media/posts/4/4.jpg",
            "author": {
                "name": "railfan"
            },
            "tags": [
                   "trains",
                   "railway"
            ],
            "date_published": "2018-09-20T22:02:01+05:30",
            "date_modified": "2018-09-20T22:02:01+05:30"
        },
        {
            "id": "https://100trains.com/collectible-trains.html",
            "url": "https://100trains.com/collectible-trains.html",
            "title": "Collectible Trains",
            "summary": "Collectible Trains Children of all ages seem to enjoy playing with trains, but may adults do as well. They may not be playing with them though as much as they are collecting them. There are true train collectors and then there are those who want&hellip;",
            "content_html": "<h2>Collectible Trains</h2>\n<br>Children of all ages seem to enjoy playing with trains, but may adults do as well. They may not be playing with them though as much as they are collecting them. There are true train collectors and then there are those who want to simply make a fun hobby out of it. Many of them in either category or current railway workers or they have since retired from the profession. <br>\n<h3>There are many great layouts you can create as a hobby for your train. With a flat piece of board that is as large as you would like, you can transform it into your own train area. There are train kits that contain smaller scale boxcars, engines, cabooses, train stations, tunnels, and tracks. You can also buy individual pieces in order to personalize your train collection. Many of the tracks even come with controllers so you can switch the tracks and have more than one train on it.</h3>\n<br>Some of the older Santa Fe train pieces are worth a large amount of money today. This is because it was one of the largest railway companies for decades. In recent years it has merged with Burlington Northern to become Burlington Northern Santa Fe. The pieces of equipment for collecting that say Santa Fe on the sides of them are collectibles that continue to increase in value.<br><br>Many of the older collectible trains from the late 1800’s and early 1900’s are extremely valuable. The majority of them are in various train museums all over the world. These early collectibles are quite heavy because they were made from iron. After those came trains made from wood. The majority of the collectible trains offered today are made from various types of durable plastic. <br><br>There are two types of gauging used for the tracks with collectible trains. If you are planning to buy separate pieces you really need to make sure you get the right gauge of equipment or it won’t work on the tracks. Your two choices are O or S scaled items. O scale items measure the distance between the outer two rails of the track. The S scale items measure the distance from the two outer rails so it is slightly larger. <br><br>Lionel Model Trains continues to be the biggest manufacturer of collectible trains today. Their hottest seller right now is the Harry Potter train that takes him and the other students to their school at the beginning of each movie. The Hogwarts Express is anticipated to sell more than the record holding Polar Express from 2004.<br><br>Whether you collect trains just to have or you use them to indulge in one of your favorite hobbies, they are delightful to have. The cost of collectible trains depends on where you purchase them and the condition they are in. You can get new pieces from many retailers but the older items you will have to purchase online, at yard sales, and even from antique stores. You may want to check with your father or grandfather though as there is a good chance they may have a box or two of them stored in the attic or the garage. <br><br>If you have old collectible trains in your home, you may want to find out what they are worth. You may be sitting on a goldmine that is just packed up in a box somewhere. There are some collectors out there looking for rare train collectibles as well as museums who are always looking for more materials to add to their displays.",
            "image": "https://100trains.com/media/posts/3/3.jpg",
            "author": {
                "name": "railfan"
            },
            "tags": [
                   "trains",
                   "railway"
            ],
            "date_published": "2018-09-19T23:27:56+05:30",
            "date_modified": "2018-09-20T21:48:32+05:30"
        },
        {
            "id": "https://100trains.com/children-and-trains.html",
            "url": "https://100trains.com/children-and-trains.html",
            "title": "Children and Trains",
            "summary": "Children and Trains Children have always fallen in love with trains, both boys and girls. They seem to have a type of magic about them. Children often get excited when they see and hear a train passing by. It can be fun to have one&hellip;",
            "content_html": "<h2>Children and Trains</h2>\n<br>Children have always fallen in love with trains, both boys and girls. They seem to have a type of magic about them. Children often get excited when they see and hear a train passing by. It can be fun to have one going over you on a bridge or passing one on the highway as you count the number of train cars on it.<br>\n<h3>There are many stories and programs that lend trains to the creative minds of children. Most of us can remember reading The Little Engine that Could. This is a timeless story about a train that kept pushing itself to reach the top of the mountain in spite of all the odds being against it. This is a great story to encourage children from a young age to never give up because they can do anything they put their minds to.</h3>\n<br>Thomas the Train has become a very popular icon for children these days. This fun blue train can be found in books and on TV. Thomas the Train is an interactive program that encourages children to learn valuable skills including counting and reading. There are also informative learning opportunities including oral hygiene and getting along with others. <br><br>What may surprise you about Thomas the Train is that he has actually been around since 1946 in Brittan. Yet it wasn’t until the movies and TV shows featuring Thomas the Train in the early 1980’s that it became so well known all around the world. The memorabilia associated with Thomas the Train has resulted in millions of dollars in revenue. They include video games, toy trains, piggy banks, back packs, and lunch boxes. <br><br>You will find the market is full of interactive trains for children of various ages to enjoy. Some of them sing songs or play music. Others allow them to push them along or they go by themselves with the touch of a button. Your child will find hours of entertainment with trains from a very early age. <br><br>For older children, you may want to invest in a model train set. They can spend hours setting up the track and the train in order to get it to go around and around. There are so many great accessories that they can add to the mix that they can personalize it to fit their style in no time. <br><br>Chances are that your child may have a particular style of train in mind that they want. They may have a sentimental reason for wanting it based on books they have watched, movies they have seen, or even their experiences with real trains. This can be a great opportunity to help your child forge lifelong memories that include their love of trains. <br><br>It is not uncommon for fathers or grandfathers to pass their trains on to their children or grandchildren. This can be a remarkable family heirloom that your child will always treasure. As time goes by many of these early models of trains will continue to increase in value. <br><br><br>Who knows, this love of trains may result in a very rewarding career for your child when they become an adult. The prices of trains vary depending on the quality and the manufacturer of them. Take a look at any toy store or online to discover what options you have to bring a smile to your child’s face by giving them a train.",
            "image": "https://100trains.com/media/posts/2/2.jpg",
            "author": {
                "name": "railfan"
            },
            "tags": [
                   "trains",
                   "railway"
            ],
            "date_published": "2018-09-19T23:26:22+05:30",
            "date_modified": "2018-09-20T17:31:50+05:30"
        },
        {
            "id": "https://100trains.com/burlington-northern-santa-fe.html",
            "url": "https://100trains.com/burlington-northern-santa-fe.html",
            "title": "Burlington Northern Santa Fe",
            "summary": "Burlington Northern Santa Fe One of the most profitable railways in the world is Burlington Northern Santa Fe (BNSF). They have been hauling goods for more than 150 years and have one of the best safety records in the train industry. They also offer some&hellip;",
            "content_html": "<h2>Burlington Northern Santa Fe</h2>\n<br>One of the most profitable railways in the world is Burlington Northern Santa Fe (BNSF). They have been hauling goods for more than 150 years and have one of the best safety records in the train industry. They also offer some of the best prices on freight out there, making it very easy for them to obtain new contracts and to maintain those they already have in place.<br>\n<h3>The origin of BNSF is a long journey that involves acquiring many small railway companies over the years. One that took place more than 20 years ago was with Santa Fe, thus the changing of the company name.</h3>\n<p> </p>\nAs a result of these buy outs, BNSF has been able to continually expand the number of miles of quality railroad tracks they have available. They have gone the extra mile on their own to place railway tracks where it is difficult but necessary even though it is expensive and there are plenty of challenges to completing such projects.<br><br>BNSF combines the very best equipment and technology with highly skilled employees. All of their train cars and engines are in top working condition to help reduce down time and accidents. They also have skilled employees to investigate railway crossings and the tracks themselves. <br><br>There is always plenty of ongoing training taking place for BNSF employees so they can keep up on the latest technology, evaluate their strengths and weaknesses, and continue to be motivated to strive for excellence in all that they do. BNSF has a very rigorous employment screening process. They check references and criminal backgrounds. They also contact previous employers to determine a person’s level of responsibility and reliability. <br><br>As a condition of employment, each person must consent to a drug test and a physical exam. Should the drug test come back positive the person will not be hired. They also have a random drug testing policy that all employees must agree to during the term of their employment. If an employee files a workman’s compensation claim they are mandated to submit to a drug test as well.<br><br>The physical examination is required to ensure the individual is healthy enough to take on the responsibilities of working for a railway company. This includes a hearing and vision test as well. There is simply too much at risk if a person isn’t healthy enough to be engaging in the various types of employment offered by BNSF. <br><br>If you are interested in finding out what positions they have available and the locations, go to their website. You will find plenty of quality information about the business as well as an application you can complete online. This is one of the best railway companies to work for because they are dedicated to excellence with their employees, their shipments, and the public. <br><br>They take pride in offering a diverse group of employees as well. They appreciate the fact that each person can bring unique qualities to the workplace. They encourage suggestions from their employees to make the railway business safer, faster, and more profitable. Today more than 38,000 people are employed by BNSF. Most of them find the experience to be very pleasant. They enjoy being part of the BNSF team. <br><br>BNSF continues to strive for excellence. They are dedicated to offering quality train services to those businesses that need goods to be moved. They are also dedicated to providing a safe way to do it. They work hard to prevent accidents among their employees, on their train tracks, and with people who happen to be crossing at various train intersections.<br><br>There is always plenty going on at BNSF to help make their trains operate faster to get the deliveries done in less time. They have won numerous awards for their excellent service, implementing the latest technology, and always putting safety above making a profit. They also give plenty of money back to communities in the way of charitable events that support various causes.",
            "image": "https://100trains.com/media/posts/1/1.jpg",
            "author": {
                "name": "railfan"
            },
            "tags": [
                   "trains",
                   "railway"
            ],
            "date_published": "2018-09-19T23:24:40+05:30",
            "date_modified": "2018-09-19T23:24:40+05:30"
        }
    ]
}
